import {Command} from "./command.js";

class HelpCommand extends Command {
    async process() {
        await this.respond(
            'Это бот канала @' + process.env.CHANNEL_HANDLE + ', ' +
            'здесь вы можете получить доступ к комментариям, пригласив в канал друга.\n' +
            'Чтобы кого-то пригласить, нужно сначала прислать его @юзернейм или переслать от него сообщение. ' +
            'У друга будет 10 минут, после этого нужно будет прислать @юзернейм или переслать сообщение заново.\n' +
            'Приглашение не сработает, если этот аккаунт уже был когда-то подписан на канал или подписался до того, как ' +
            'вы прислали его @юзернейм/переслали сообщение.\n\n' +
            'Пожаловаться или поблагодарить можно командой\n' +
            '/report Some useful information here\n\n' +
            'Отменить приглашение можно командой\n' +
            '/cancel'
        )
    }
}

export {HelpCommand}