import {Command} from "./command.js";

class HelpCommand extends Command {
    async process() {
        /** TODO */
        await this.respond(
            'Это бот канала @' + process.env.CHANNEL_HANDLE + ', ' +
            'здесь вы можете получить доступ к комментариям, пригласив в канал друга.\n' +
            'Чтобы кого-то пригласить, нужно сначала прислать его @юзернейм или ID. ' +
            'У друга будет 10 минут, после этого нужно будет прислать @юзернейм или ID заново.\n' +
            'Приглашение не сработает, если этот аккаунт уже был когда-то подписан на канал или подписался до того, как ' +
            'вы прислали его @юзернейм/ID.\n\n' +
            'Чтобы узнать ID пользователя, отправьте:\n' +
            '/id\n\n' +
            'Чтобы проверить подписку, отправьте:\n' +
            '/check\n\n' +
            'Пожаловаться или поблагодарить можно командой:\n' +
            '/report Some useful information here\n\n' +
            'Отменить приглашение можно командой:\n' +
            '/cancel'
        )
    }
}

export {HelpCommand}