import {Command} from "./command.js";

class HelpCommand extends Command {
    async process() {
        await this.respond(
            'Это бот канала @' + process.env.CHANNEL_HANDLE + ', ' +
            'здесь вы можете получить доступ к комментариям, пригласив в канал другого пользователя.\n' +
            'Чтобы кого-то пригласить, нужно сначала прислать его @юзернейм или ID. ' +
            'Теперь пользователь должен подписаться, после этого, нужно либо подождать час, ' +
            'либо прислать команду /check чтобы бот проверил,' +
            'подписался ли приглашенный (да, неудобно, виноват телеграм).\n\n' +
            'За каждого приглашённого пользователя вы получаете одну жизнь. Если кол-во жизней достигнет нуля, ' +
            'доступ к комментариям будет закрыт.\n' +
            'Приглашение не сработает, если этот аккаунт уже был когда-то подписан на канал или подписался до того, как ' +
            'вы прислали его @юзернейм/ID.\n\n' +
            'Чтобы узнать ID пользователя, он должен отправить:\n' +
            '/id\n\n' +
            'Чтобы проверить приглашение, отправьте:\n' +
            '/check\n\n' +
            'Пожаловаться или поблагодарить можно командой:\n' +
            '/report Some useful information here\n\n' +
            'Отменить приглашение можно командой:\n' +
            '/cancel\n\n' +
            'Чтобы узнать кол-во жизней, отправьте:\n' +
            '/lives'
        )
    }
}

export {HelpCommand}